# -*- coding: utf-8 -*-
'''
Задание 5.1a

Всё, как в задании 5.1. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.1.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''
ip_mask = input('Введите IP-сети: ')
tmp = ip_mask.split('/')
ip = [int(i) for i in tmp[0].split('.')]
nmask = int(tmp[1])
mask = ''
for i in range(32):
    if i < nmask:
        mask += '1'
    else:
        mask += '0'
m = [int(mask[8*i:8*(i+1)], 2) for i in range(4)]

ip_bit = '{:08b}{:08b}{:08b}{:08b}'.format(ip[0], ip[1], ip[2], ip[3])
ip_net_bit = ip_bit[0:nmask] + mask[nmask:32]
ip = [int(ip_net_bit[8*i:8*(i+1)], 2) for i in range(4)]


template = '''
Network:
{i0:<8} {i1:<8} {i2:<8} {i3:<8}
{i0:08b} {i1:08b} {i2:08b} {i3:08b}

Mask:
/{m}
{m0:<8} {m1:<8} {m2:<8} {m3:<8}
{m0:08b} {m1:08b} {m2:08b} {m3:08b}
'''
print(template.format(i0=ip[0],i1=ip[1],i2=ip[2],i3=ip[3],
                      m=nmask,m0=m[0],m1=m[1],m2=m[2],m3=m[3]))
